src/test/testtool/ZoekMetPostcodeEnHuisnummer/03/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">test</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">test123</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301"/>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">TOP</applicatie>
			<gebruiker xmlns="http://www.egem.nl/StUF/StUF0301">TEST</gebruiker>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241015062939134</StUF:tijdstipBericht>
		<StUF:crossRefnummer>6bdd32e3-91bb-44ac-befb-cccc3ec661fe</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>3</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">999994335</inp.bsn>
			<inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Holthuizen</geslachtsnaam>
			<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">P.F.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Pepijn Floris</voornamen>
			<aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">19800526</geboortedatum>
			<inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.verblijfBuitenland xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</sub.verblijfBuitenland>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xmlns="http://www.egem.nl/StUF/sector/bg/0310">1</inp.burgerlijkeStaat>
			<inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
		</BG:object>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">999994736</inp.bsn>
			<inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Burck</geslachtsnaam>
			<voorvoegselGeslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">du</voorvoegselGeslachtsnaam>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">K.M.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Karin Monique</voornamen>
			<aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">V</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">19511223</geboortedatum>
			<inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.verblijfBuitenland xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</sub.verblijfBuitenland>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xmlns="http://www.egem.nl/StUF/sector/bg/0310">1</inp.burgerlijkeStaat>
			<inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
		</BG:object>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">999994293</inp.bsn>
			<inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Holthuizen</geslachtsnaam>
			<voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorletters xmlns="http://www.egem.nl/StUF/sector/bg/0310">D.</voorletters>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Dirk</voornamen>
			<aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">19460121</geboortedatum>
			<inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.verblijfBuitenland xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland1 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland2 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<sub.adresBuitenland3 xsi:nil="true" StUF:noValue="waardeOnbekend"/>
			</sub.verblijfBuitenland>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xmlns="http://www.egem.nl/StUF/sector/bg/0310">1</inp.burgerlijkeStaat>
			<inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>